#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

stdout:
module.satire_bot.aws_iam_role.assume_role: Refreshing state... [id=iam_for_lambda]
module.satire_bot.aws_lambda_function.satire_lambda["ping_pong"]: Refreshing state... [id=ping_pong]
module.satire_bot.aws_iam_role_policy_attachment.basic: Refreshing state... [id=iam_for_lambda-20220403042457231500000001]
module.satire_bot.aws_lambda_function.satire_lambda["pong_ping"]: Refreshing state... [id=pong_ping]
module.satire_bot.heroku_app.satire_bot: Refreshing state... [id=dd7d7dee-674b-4701-b711-91270c700004]
module.satire_bot.heroku_build.satire_bot: Refreshing state... [id=836ba1f3-9ba0-461e-9189-43e41fa9984f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.satire_bot.aws_lambda_function.satire_lambda["ping_pong"] has changed
  ~ resource "aws_lambda_function" "satire_lambda" {
        id                             = "ping_pong"
      + layers                         = []
      + tags                           = {}
        # (25 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.satire_bot.aws_lambda_function.satire_lambda["pong_ping"] has changed
  ~ resource "aws_lambda_function" "satire_lambda" {
        id                             = "pong_ping"
      + layers                         = []
      + tags                           = {}
        # (25 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.satire_bot.heroku_build.satire_bot has changed
  ~ resource "heroku_build" "satire_bot" {
        id                = "836ba1f3-9ba0-461e-9189-43e41fa9984f"
      ~ output_stream_url = "https://build-output.heroku.com/streams/dd/dd7d7dee-674b-4701-b711-91270c700004/logs/83/836ba1f3-9ba0-461e-9189-43e41fa9984f.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220403%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220403T193000Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=55fc9e8b009b50a767384ff9ce3d61cade9625c3d2375a1051cd058800079c39" -> "https://build-output.heroku.com/streams/dd/dd7d7dee-674b-4701-b711-91270c700004/logs/83/836ba1f3-9ba0-461e-9189-43e41fa9984f.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220406%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220406T011052Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=af409cc4f157b0727a91d9ffa3bacea4626101f85a79c7db95d67e2ee0b221d0"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.satire_bot.aws_iam_access_key.event_notifier will be created
  + resource "aws_iam_access_key" "event_notifier" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "event-emitter"
    }

  # module.satire_bot.aws_iam_role_policy_attachment.basic will be destroyed
  # (because aws_iam_role_policy_attachment.basic is not in configuration)
  - resource "aws_iam_role_policy_attachment" "basic" {
      - id         = "iam_for_lambda-20220403042457231500000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "iam_for_lambda" -> null
    }

  # module.satire_bot.aws_iam_user.event_notifier will be created
  + resource "aws_iam_user" "event_notifier" {
      + arn                  = (known after apply)
      + force_destroy        = false
      + id                   = (known after apply)
      + name                 = "event-emitter"
      + path                 = "/satire-bot/"
      + permissions_boundary = "arn:aws:iam::aws:policy/service-role/AWSLambdaRole"
      + tags_all             = (known after apply)
      + unique_id            = (known after apply)
    }

  # module.satire_bot.aws_iam_user_policy.event_notifier will be created
  + resource "aws_iam_user_policy" "event_notifier" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + user   = "event-emitter"
    }

  # module.satire_bot.aws_lambda_function.satire_lambda["ping_pong"] will be destroyed
  # (because aws_lambda_function.satire_lambda is not in configuration)
  - resource "aws_lambda_function" "satire_lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:422800043859:function:ping_pong" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - filename                       = "../bazel-bin/satire-bot/ping_pong.zip" -> null
      - function_name                  = "ping_pong" -> null
      - handler                        = "ping_pong" -> null
      - id                             = "ping_pong" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:422800043859:function:ping_pong/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2022-04-03T19:29:13.833+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:422800043859:function:ping_pong:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::422800043859:role/iam_for_lambda" -> null
      - runtime                        = "go1.x" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "TSHMEVG1+MQYYmCGhkPWt6Rus+VNek7WcwmLCQdBAvI=" -> null
      - source_code_size               = 5633762 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "SATBOT_DISCORD_TOKEN" = (sensitive)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.satire_bot.aws_lambda_function.satire_lambda["pong_ping"] will be destroyed
  # (because aws_lambda_function.satire_lambda is not in configuration)
  - resource "aws_lambda_function" "satire_lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:422800043859:function:pong_ping" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - filename                       = "../bazel-bin/satire-bot/pong_ping.zip" -> null
      - function_name                  = "pong_ping" -> null
      - handler                        = "ping_pong" -> null
      - id                             = "pong_ping" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:422800043859:function:pong_ping/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2022-04-03T19:29:00.917+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:422800043859:function:pong_ping:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::422800043859:role/iam_for_lambda" -> null
      - runtime                        = "go1.x" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "7EUgxVS65o6nMnIV0VLdV9THSIO0zwqwX4LFN6WNW+I=" -> null
      - source_code_size               = 5379836 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "SATBOT_DISCORD_TOKEN" = (sensitive)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.satire_bot.aws_lambda_function.satire_lambdas["ping_pong"] will be created
  + resource "aws_lambda_function" "satire_lambdas" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../bazel-bin/satire-bot/ping_pong.zip"
      + function_name                  = "ping_pong"
      + handler                        = "ping_pong"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::422800043859:role/iam_for_lambda"
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "TSHMEVG1+MQYYmCGhkPWt6Rus+VNek7WcwmLCQdBAvI="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SATBOT_DISCORD_TOKEN" = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.satire_bot.aws_lambda_function.satire_lambdas["pong_ping"] will be created
  + resource "aws_lambda_function" "satire_lambdas" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../bazel-bin/satire-bot/pong_ping.zip"
      + function_name                  = "pong_ping"
      + handler                        = "pong_ping"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::422800043859:role/iam_for_lambda"
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "n62vg7MvgG5TyM1pcDVmflk3uYj6f3660gVB1a8OqXA="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SATBOT_DISCORD_TOKEN" = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.satire_bot.heroku_app.satire_bot will be updated in-place
  ~ resource "heroku_app" "satire_bot" {
        id                    = "dd7d7dee-674b-4701-b711-91270c700004"
        name                  = "satire-bot"
      ~ sensitive_config_vars = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.satire_bot.heroku_build.satire_bot must be replaced
-/+ resource "heroku_build" "satire_bot" {
      ~ buildpacks        = [
          - "https://buildpack-registry.s3.amazonaws.com/buildpacks/heroku/go.tgz",
        ] -> (known after apply)
      ~ id                = "836ba1f3-9ba0-461e-9189-43e41fa9984f" -> (known after apply)
      ~ local_checksum    = "SHA256:fb6f0ef985fa13c1568164cee389536c927cc61bca3eb15acb2a5a8159467fb3" -> "SHA256:0c00d1ba0de5851b8b5a56d2dfbaddca6e2e0b13f5c30ebadc0e173599f840dc" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/dd/dd7d7dee-674b-4701-b711-91270c700004/logs/83/836ba1f3-9ba0-461e-9189-43e41fa9984f.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220406%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220406T011052Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=af409cc4f157b0727a91d9ffa3bacea4626101f85a79c7db95d67e2ee0b221d0" -> (known after apply)
      ~ release_id        = "dd0f2498-c2ca-40ea-b82d-4456007e80ac" -> (known after apply)
      ~ slug_id           = "a9278f9e-0631-4982-bfea-4ef409cbee19" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "lucasyharada@gmail.com"
              - id    = "a3800f25-eaa7-417d-9b9d-5f3b7953685e"
            },
        ] -> (known after apply)
      ~ uuid              = "836ba1f3-9ba0-461e-9189-43e41fa9984f" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ source {
          + checksum = (known after apply)
          ~ path     = "../satire-bot" -> "../satire-bot/iac/.." # forces replacement
        }
    }

Plan: 6 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

stderr:

```

</details>